Конфигурация/InformationRegisters/УсловияДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеобходимыеРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоматическаяПролонгация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантСрокаПролонгации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСрокаПролонгации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПролонгации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипИнвестиционногоНалоговогоВычета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхНалоговыхВычетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЧувствительности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаскрытияИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаскрытияИнформацииОКонфликтеИнтересов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаправлениеИспользованияЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияДоговоровДоверительногоУправления/Ext/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет 
			И НЕ ЗначениеЗаполнено(Запись.ТипИнвестиционногоНалоговогоВычета) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В условиях Счета ДУ """ + Запись.СчетДоверительногоУправления + """ не указан ""Тип инвестиционного налогового вычета""",,,,Отказ);
		КонецЕсли;
		
		Если (Запись.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ
				Или Запись.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
			И НЕ ЗначениеЗаполнено(Запись.НеобходимыеРасходы) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В условиях Счета ДУ """ + Запись.СчетДоверительногоУправления + """ не заполнен предельный процент необходимых расходов",,,,Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьВСоставеСчетаДоверительногоУправления")
		И НЕ УниверсальныеМеханизмы.УдалениеНабораЗаписейРегистраВСоставеВедущегоИзмерения(ЭтотОбъект) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменение условий доворов ДУ производится через форму счёта внутреннего учёта",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	// Проверим, разрешен ли флажок оплаты вознаграждений и расходов спец. депа за счет средств клиента	
	Если ЕстьОшибкиЗаполненияФлагаОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОрганизациюИзВедущегоИзмерения(ЭтотОбъект, "СчетДоверительногоУправления");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		УниверсальныеМеханизмы.ПроверкаЗаполненияИзмеренияИлиРесурса(ЭтотОбъект, Запись, "ВариантСрокаПролонгации", Отказ, Запись.АвтоматическаяПролонгация);
		
		Если Запись.ВариантСрокаПролонгации = Перечисления.ВариантыСрокаПролонгации.КоличествоЛетСрокаПролонгации
		 ИЛИ Запись.ВариантСрокаПролонгации = Перечисления.ВариантыСрокаПролонгации.КоличествоДнейСрокаПролонгации Тогда
			УниверсальныеМеханизмы.ПроверкаЗаполненияИзмеренияИлиРесурса(ЭтотОбъект, Запись, "СрокПролонгации", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьОшибкиЗаполненияФлагаОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента(Отказ)
		
	Если ЭтотОбъект.Количество() > 0 Тогда
	
		ТаблицаНабораЗаписей = ЭтотОбъект.Выгрузить();
		
		СтрокиСФлагом = ТаблицаНабораЗаписей.НайтиСтроки(Новый Структура("ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента", Истина));
		      	
		Если СтрокиСФлагом.Количество() > 0 Тогда
			МассивСчетовДУ = Новый Массив;
			Для Каждого ТекСтрока Из СтрокиСФлагом Цикл
				РаботаСКоллекциями.ДополнитьМассив(МассивСчетовДУ, ТекСтрока.СчетДоверительногоУправления, Истина);
			КонецЦикла;
			
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
				|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
				|ИЗ
				|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
				|ГДЕ
				|	СчетаДоверительногоУправления.Ссылка В(&МассивСчетовДУ)
				|ИТОГИ ПО
				|	ВидДоговораДоверительногоУправления");
			
			Запрос.УстановитьПараметр("МассивСчетовДУ", МассивСчетовДУ);
			
			ТекстСообщения = "";
			ВыборкаВидДоговора = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидДоговора.Следующий() Цикл 
				
				Если РегистрыСведений.УсловияДоговоровДоверительногоУправления.ДляВидаДоговораДУВозможнаОплатаВознагражденияУправляющегоИРасходовСпецдепозитарияИзСобственныхСредствКлиента(ВыборкаВидДоговора.ВидДоговораДоверительногоУправления) Тогда
					Продолжить;
				КонецЕсли;
				
				ТекстСообщения = СтрШаблон("Для вида договора %1 не разрешена установка флага 'Оплата вознаграждения управляющего и расходов спецдепозитария за счет собственных средств клиента'. Счета ДУ этого вида:%2", ВыборкаВидДоговора.ВидДоговораДоверительногоУправления, Символы.ПС);
				ВыборкаСчетаДУ = ВыборкаВидДоговора.Выбрать();
				Пока ВыборкаСчетаДУ.Следующий() Цикл
					ТекстСообщения = ТекстСообщения + СтрШаблон("%1 - %2%3", Символы.Таб, ВыборкаСчетаДУ.СчетДоверительногоУправления, Символы.ПС);
				КонецЦикла;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
								
			КонецЦикла;
			
			Если Не ПустаяСтрока(ТекстСообщения) Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЕсли; 
				
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции
